[
  {
    "id": "ca6cff0a-f46e-4813-8e19-b1602b1e5ac1",
    "name": "Truke Newly Launched Buds Liberty Open Ear Wireless Earbuds ",
    "description": "About this item\r\n🎵 Immersive Audio Experience: Experience multidimensional sound that puts you at the center of your audio world with Buds Liberty's 360Spatial Audio Experience. These Open Ear Earbuds (OWS) transforms your listening experience, ensuring every detail surrounds you in perfect harmony. Enjoy immersive surround sound and detailed, rich audio quality, thanks to the powerful 16mm beryllium speakers that deliver an unparalleled auditory experience.\r\n🛋️ All-Day Comfort and Fit: Experience unmatched comfort all day long with Buds Liberty. Featuring super soft silicon stems, these earbuds provide unparalleled comfort for extended wear. Whether you're working, exercising, or relaxing, enjoy a secure and gentle fit that adapts to your every move. The flexible memory titanium wire and ergonomic design ensure a perfect, gentle, and secure fit for all-day comfort.\r\n🔋 Comfort that Lasts, Power that Endures: Designed for pain-free wear, even during extended use, these earbuds let you stay focused on your activities without discomfort. Enjoy up to 60 hours of playtime with the charging case and up to 12 hours on a single charge, ensuring you stay connected and entertained throughout your day. Whether you're working, exercising, or relaxing, Truke Buds Liberty provides the comfort and battery life you need.\r\n🏃‍♂️ Ideal for Sports Enthusiasts: Designed for sports enthusiasts, Buds Liberty offers a secure and comfortable fit for all your active pursuits. Enjoy uninterrupted music and calls with IPX5 water resistance and an ergonomic design. The secure fit ensures they stay in place during any activity, while the IPX5 rating makes them sweat and water-resistant for your toughest workouts. The ergonomic design guarantees comfort for extended wear, perfect for long runs or gym sessions.\r\n🎙️ Experience Unparalleled Purity: Featuring Quad Mic PureVoice ENC Technology, every conversation is delivered with crystal-clear precision, ensuring that every word is heard distinctly. Our Wind Noise Reduction Technology further enhances clarity by eliminating background noise, making Buds Liberty ideal for crowded environments or outdoor use. Stay connected seamlessly with uninterrupted conversations wherever life takes you.\r\n🔗 Seamless Connectivity and Elegant Design: Experience seamless connectivity with Bluetooth 5.4, ensuring a stable and efficient connection. Enjoy the sleek dual-tone finish of Buds Liberty, combining matte and metallic accents for a sophisticated look. The elegant design is complemented by 1-step pairing, making it effortless to connect and enjoy your music instantly.\r\n🌐 Smart Assistant Integration: Stay connected and in control with Google and Siri Assistant support on Buds Liberty. Easily access your favorite voice assistants for hands-free commands, making it simple to manage your day, get directions, or control your music without lifting a finger. Enjoy seamless interaction with your smart devices for an enhanced listening experience.",
    "price": "1599",
    "imageUrl": "https://m.media-amazon.com/images/I/61SuuPF108L._SL1500_.jpg",
    "affiliateLink": "https://amzn.to/4aOD00g",
    "category": "Electronics",
    "clicks": 2,
    "createdAt": "2026-02-23T17:56:05.010Z"
  },
  {
    "id": "dea67e37-1d0c-4d83-a61f-a2cd097bb182",
    "name": "EPOS IMPACT 1060T Adaptive ANC Professional Office Wireless On Ear Headset ",
    "description": "The EPOS IMPACT 1060T ANC is designed for professionals needing high-performance noise cancellation in open offices and remote work. Featuring hybrid adaptive ANC, this wireless headset with mic effectively blocks out background noise to help you stay focused. EPOS AI adaptive microphones ensure superior voice pickup, delivering crystal-clear calls on Microsoft Teams, Zoom, and Skype. With super wideband audio, this Bluetooth headset for work enhances natural speech clarity, making conversations more lifelike. Triple wireless connectivity lets you seamlessly switch between PC, laptop, smartphone, and tablet for uninterrupted workflows. Intuitive controls allow you to mute calls by moving the boom arm, while the included contactless charging stand keeps your headset powered at all times. Perfect for office professionals, call centers, and hybrid workers, the EPOS IMPACT 1060T ANC is a wireless PC headset for work, Windows, Mac, and mobile, offering advanced noise reduction and effortless communication.",
    "price": "29153",
    "imageUrl": "https://m.media-amazon.com/images/I/51bG+xa9fKL._SL1500_.jpg",
    "affiliateLink": "https://amzn.to/46hEdMo",
    "category": "Electronics",
    "clicks": 0,
    "createdAt": "2026-02-23T17:59:30.741Z"
  },
  {
    "id": "18eb1a4f-939f-4c14-a9eb-6cd473a510d7",
    "name": "Burnlab 6 in 1 multifunctional weight training kit",
    "description": "About this item\r\nConvertible features: The dumbbell can be converted into a barbell using the connecting bar and the push-up bars can be used to turn the dumbbell into a kettlebell. The weights adjust from 2 to 28 Kgs.\r\nLong-lasting: The new and adjustable weight design from burnlab allows you to increase the weight over time without having to buy new weights.\r\nNew safety measures: Diamond knurled grip allows for a secure and non-slip grip, thickened nuts ensure that no weights fall and the anti-slip design prevents you from cutting your hands.\r\n20MM foam barbell: Thickened foam in the barbell rod fits more comfortably on the neck and also helps in preventing any injuries.\r\nBurnlab weights allow you to enjoy the benefits of a fully equipped gym without having to go to the gym! Rewrite the rules of fitness with Burnlab.\r\n12kgs dumbbell set contains: 4 plates × 1.25kg = 5kg, 4 plates × 1.5kg = 6kg, & other accessories of 1kg. 28kgs dumbbell set contains: 4 plates × 1.25kg =5kg, 4 plates × 1.5kg = 6kg, 8 plates × 2kg = 16kg & other accessories of 1kg.\r\n20kgs dumbbell set contains: 4 plates × 1.25kg =5kg, 4 plates × 1.5kg = 6kg, 4 plates × 2kg = 8kg & other accessories of 1kg",
    "price": "4355",
    "imageUrl": "https://m.media-amazon.com/images/I/618Nlj8pN3L._SL1080_.jpg",
    "affiliateLink": "https://amzn.to/3ZSiuXD",
    "category": "Health",
    "clicks": 0,
    "createdAt": "2026-02-23T18:03:14.943Z"
  },
  {
    "id": "ef895312-6d6e-41f6-904a-ca56f66250b0",
    "name": "Flexnest Commercial Grade Adjustable And Foldable Gym Bench",
    "description": "About this item\r\nHeavy-Duty Construction: Built for durability and stability, this gym bench boasts a robust frame with a flat 250 kg weight capacity, ensuring safety and reliability during intense workouts. The premium leather upholstery adds comfort and luxury to your exercise experience.\r\nIncline, Decline, and Flat Settings: The bench can be adjusted to various angles, allowing you to perform a wide range of exercises targeting different muscle groups. Whether you need an incline for shoulder presses or a decline for abdominal exercises, this bench accommodates your workout needs.\r\nSpace-Saving Storage: The bench features a foldable design that allows it to be compactly stored when not in use. This makes it ideal for home gyms with limited space, as it can be easily folded and tucked away.\r\nDurable and Comfortable: The bench is upholstered in high-quality PU leather, offering both durability and comfort. This material is easy to clean and maintains its appearance over time, while also providing a cushioned surface for your workouts.\r\nEnhanced Exercise Options: Included with the bench are resistance ropes, which can be used to add extra resistance to your exercises. These ropes are great for increasing the intensity of your workouts and can be used for strength training and stretching.\r\nUser-Friendly Setup: The bench comes with clear and straightforward assembly instructions, making it easy to set up and start using right away. This ensures that you can quickly get your home gym up and running with minimal hassle.",
    "price": "4998",
    "imageUrl": "https://m.media-amazon.com/images/I/51OhfWQPZ9L._SL1080_.jpg",
    "affiliateLink": "https://amzn.to/3ZSrQ5G",
    "category": "General",
    "clicks": 0,
    "createdAt": "2026-02-23T18:03:58.423Z"
  },
  {
    "id": "53a8a24c-8f04-41ee-9720-214d1cb019a4",
    "name": "amazon basics Rubber Encased Hex ",
    "description": "About this item\r\nDumbbell for resistance training—great for arms, chest, back, core, and legs\r\nSolid cast-iron core for reliable strength; will not bend or break after repeated use\r\nHexagon-shaped rubber-encased ends help prevent rolling and promote stay-in-place storage\r\nContoured, textured, chrome handle for a comfortable, secure grip",
    "price": "1499",
    "imageUrl": "https://m.media-amazon.com/images/I/61NTHKaehvL._SL1500_.jpg",
    "affiliateLink": "https://amzn.to/4aOC3oX",
    "category": "Health",
    "clicks": 0,
    "createdAt": "2026-02-23T18:04:49.475Z"
  },
  {
    "id": "e840e181-ec3d-45f6-b5c3-02bfe30d7960",
    "name": "AS-IT-IS Nutrition ATOM Whey Protein 1kg | 27g",
    "description": "About this item\r\nBOOSTS YOUR PERFORMANCE TO NEXT LEVEL: When compared to others, Atom Whey protein has greater bioavailability, solubility and the highest PDCAA score of 1. The high-quality protein offers 27g protein per serving, 5.7g BCAA, 4.8g glutamine with minimal calories, fat and no sugar. Whether you engage in aerobic or resistance training, Whey protein supplementation helps you get the best out of every workout.\r\nHIGH CONCENTRATION OF BCAA: The high concentration of BCAAs in Atom Whey Protein help promote anabolic response by maximizing muscle protein synthesis, helps preserve muscle glycogen stores, and minimize protein breakdown. BCAAs reduce the amount of tryptophan and the amount of serotonin produced, eventually allowing you to make more gains.\r\nAUTHENTIC & QUALITY ASSURED: Atom Whey Protein is 100% authentic and goes through stringent analysis before it finally reaches the customers. It is manufactured at an FSSAI approved and GMP certified manufacturing plant. The supplement includes the best ever blend of Whey protein concentrate and Whey protein isolate to boost your power within and promote optimal gains. The product allows you to validate the authenticity before opening the seal.\r\nIDEAL PROTEIN FOR EVERYONE: The 100% vegetarian, easy, & convenient AtomWhey protein supplement has an edge over other protein supplements in terms of fueling the muscle tissue. Whey serves as a mainstay protein not only for those interested in building muscle mass but also for those who turn to dietary protein to fill the protein gaps in a varied diet. The deliciously flavoured Whey fits all and comes with an enzyme blend to facilitate faster assimilation of Whey.\r\nAMPS MUSCLE SYNTHESIS & MUSCLE RECOVERY: Strength training causes micro-tears in muscle fibres, which trigger inflammation and the body’s repair process. Whey digests faster than other forms of protein meaning that the body is able to receive the essential amino into the muscles at a faster rate, resulting in faster overall recovery. Consuming Whey within 30 minutes of exercise increases the body’s ability to stimulate protein synthesis & reduce muscle soreness.",
    "price": "2299",
    "imageUrl": "https://m.media-amazon.com/images/I/71dgycc8LHL._SL1500_.jpg",
    "affiliateLink": "https://amzn.to/4qNM4sh",
    "category": "Health",
    "clicks": 0,
    "createdAt": "2026-02-23T18:05:48.108Z"
  }
]